[
    {
        "title": "Фото: Утренний намаз в Рамазан хайит в Ташкенте",
        "context": "Рано утром 21 апреля в мечетях Узбекистана совершили праздничную молитву в честь окончания месяца Рамазан. Фоторепортаж корреспондента «Газеты.uz» Шохруха Хайдарова из мечети Мулла Косим в Ташкенте.",
        "publication": "Сегодня, 10:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/4dm2cX16820516024373_m.jpg"
    },
    {
        "title": "Куда сходить на выходных в Ташкенте",
        "context": "Шесть кинопремьер и кинопоказы под открытым небом, концерты, вечеринки, ярмарки, мероприятия для детей и другие события предстоящих четырёх выходных — в подборке Afisha.uz.",
        "publication": "Вчера, 21:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/NsHCyd16814739114809_m.jpg"
    },
    {
        "title": "Указом президента Узбекистана помилован 541 человек",
        "context": "Президент Узбекистана подписал указ, которым помилован 541 человек, отбывающий наказание за совершение преступлений. Среди них 36 граждан иностранных государств, 136 женщин и 75 мужчин старше 60 лет.",
        "publication": "Вчера, 21:05",
        "image_link": "https://www.gazeta.uz/media/img/2017/12/zVpDrr15126720893731_m.jpg"
    },
    {
        "title": "Объявление выходных вызвало пробки и скачок цен на междугороднее такси",
        "context": "После объявления даты Рамазан хайита в Ташкенте и на выезде из города возникли длинные пробки, подскочили цены на междугородний транспорт, а бизнес столкнулся с накладками: кто-то — с отменой заказов, а кто-то — с наплывом клиентов.",
        "publication": "Вчера, 20:36",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/nZkGvd16820019258061_m.jpg"
    },
    {
        "title": "Что приготовить на Рамазан хайит: праздничные блюда",
        "context": "Самса «Тюльпан», праздничный плов, самса-шурпа, манты «Розочка», пахлава, медовый хворост и другие идеи блюд на Рамазан хайит — в подборке Zira.uz.",
        "publication": "Вчера, 19:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/dFVec616819687826304_m.jpg"
    },
    {
        "title": "Chery принимает участие на выставке Shanghai Auto Show",
        "context": "Компания Chery выходит на новый уровень с технологией PHEV третьего поколения, которую представила на Шанхайской автомобильной выставке Shanghai Auto Show.",
        "publication": "Вчера, 19:00",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/qxXxW416819873549507_m.jpg"
    },
    {
        "title": "Освобождение деревьев от бетона началось в Ташкенте (фото)",
        "context": "В Ташкенте началась акция по освобождению деревьев от бетона, рекламных баннеров и подсветки. Глава Минприроды Азиз Абдухакимов вскрыл ломом цемент у корней дерева и попросил граждан помочь в устранении подобных ситуаций, сообщая о них через Telegram-бот.",
        "publication": "Вчера, 17:56",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/DxUjpJ16819880660682_m.jpg"
    },
    {
        "title": "Мужчина, напавший на школьницу в Ташкенте, задержан",
        "context": "В ГУВД Ташкента сообщили, что мужчина, напавший на 17-летнюю школьницу, задержан. Им оказался 26-летний житель Самаркандской области.",
        "publication": "Вчера, 17:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/Ymacf516819921812826_m.jpg"
    },
    {
        "title": "Мужчина напал на школьницу в Ташкенте",
        "context": "В соцсетях распространилось видео, на котором мужчина нападает на идущую по улице школьницу. Сообщается, что инцидент произошёл в Мирабадском районе Ташкента. Личность нападавшего устанавливается.",
        "publication": "Вчера, 16:08",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/axbXZm16819872910619_m.jpg"
    },
    {
        "title": "Верховный суд Узбекистана реабилитировал ещё 208 человек, репрессированных в 1930−31 годах",
        "context": "Верховный суд Узбекистана реабилитировал ещё 208 человек, репрессированных в 1930 и 1931 годах. Ранее были реабилитированы 408 человек. Список жертв репрессий составлен республиканской рабочей группой, образованной распоряжением президента в октябре 2020 года.",
        "publication": "Вчера, 16:03",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/zBmMjF16819851427566_m.jpg"
    },
    {
        "title": "Утром 21 апреля на ряде улиц Ташкента ограничат движение",
        "context": "В связи с празднованием Рамазан хайита 21 апреля с полуночи до 7:30 ряд улиц Ташкента будет закрыт для движения транспорта.",
        "publication": "Вчера, 15:47",
        "image_link": "https://www.gazeta.uz/media/img/2022/05/OdI9iO16518210847723_m.jpg"
    },
    {
        "title": "Фото: Борьба с ДТП в Кашкадарье",
        "context": "На одной из дорог в Кашкадарье установили автомобиль, пострадавший в ДТП. В СБДД МВД Узбекистана сообщили, что это должно помочь в предупреждении аварий.",
        "publication": "Вчера, 15:37",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/4H2Bpc16819867673805_m.jpg"
    },
    {
        "title": "Учителю, избившему коллег-женщин, многое сходило с рук — пострадавшая",
        "context": "Учитель физкультуры, избивший коллег-женщин в Сурхандарье, находился на свободе, пока видео об этом не появилось в интернете, рассказала «Газете.uz» одна пострадавшая. По её словам, такие случаи происходили и раньше, но он избегал наказания — по его поведению все думали, что «за ним кто-то стоит».",
        "publication": "Вчера, 15:13",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/BUHYdT16818169147286_m.jpg"
    },
    {
        "title": "«Узпромстройбанк» выдал клиентам сертификаты на получение кредита за один день",
        "context": "Имея на руках сертификат от «Узпромстройбанка», клиенты могут получить кредит в течение одного дня, без необходимости предоставлять дополнительные документы и залог.",
        "publication": "Вчера, 15:00",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/D6ziQb16819801695283_m.jpg"
    },
    {
        "title": "Апелляцию осуждённых по делу о нукусских событиях рассмотрят в Ташкенте",
        "context": "Апелляционные жалобы осуждённых по первому процессу о нукусских событиях рассмотрят в Ташкенте.",
        "publication": "Вчера, 14:57",
        "image_link": "https://www.gazeta.uz/media/img/2019/07/7kVNvO15638090855778_m.jpg"
    },
    {
        "title": "В праздничные выходные будет тёплая и сухая погода",
        "context": "Погода в праздничные выходные ожидается тёплая и сухая, температура воздуха продолжит подниматься и к началу новой недели достигнет +30 градусов.",
        "publication": "Вчера, 13:17",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/Q4juDq16819686285743_m.jpg"
    },
    {
        "title": "Фото: «Воскресенье здорового гражданина», «Дубай отмен» — агитация референдума в Узбекистане",
        "context": "Референдум по новой Конституции состоится уже через 10 дней. В городах появляется всё больше материалов, которые агитируют граждан прийти голосовать. Корреспондент «Газеты.uz» сфотографировал подготовку Ташкента к предстоящему событию.",
        "publication": "Вчера, 12:37",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/D8oSQM16819761644574_m.jpg"
    },
    {
        "title": "Международный фестиваль ландшафтного искусства пройдёт в Ташкенте",
        "context": "Международный экофестиваль ландшафтного искусства GreenArt пройдёт в Ташкенте 27−29 апреля. Его задача — повысить экологическую грамотность и привлечь общественность к процессу ландшафтного озеленения и проектирования, питомниководства.",
        "publication": "Вчера, 12:34",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/hfHTco16819715736978_m.jpg"
    },
    {
        "title": "Фото: Автобусы-гармошки вернулись на улицы Ташкента",
        "context": "В Ташкенте на маршруты выехали сразу 400 новых китайских автобусов и электробусов большой и особо большой вместимости, преобразив улицы столицы. Среди них есть и 18-метровые «гармошки» (последний такой автобус работал в городе 10 лет назад). Корреспонденты «Газеты.uz» проехались на новых автобусах.",
        "publication": "Вчера, 12:04",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/dh3bji16819700381294_m.jpg"
    },
    {
        "title": "21 и 24 апреля объявлены выходными днями в Узбекистане",
        "context": "Указом и постановлением президента 21 и 24 апреля объявлены выходными днями. Таким образом, жители Узбекистана отдохнут четыре дня подряд.",
        "publication": "Вчера, 11:19",
        "image_link": "https://www.gazeta.uz/media/img/2023/03/EeowKt16789538336761_m.jpg"
    }
]