[
    {
        "title": "Silk Avia начинает коммерческие полёты",
        "context": "Региональная авиакомпания Silk Avia с 25 апреля начинает выполнять коммерческие полёты из Ташкента в Термез, Навои, Наманган, Карши, а также Ургенч (через Бухару и Самарканд).",
        "publication": "Сегодня, 15:18",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/mW5p1n16820041299813_m.jpg"
    },
    {
        "title": "Узбекистан резко нарастил импорт газа на фоне падения его добычи",
        "context": "В марте Узбекистане импортировал газ на 151,2 млн долларов, что составляет больше половины импорта этого сырья за весь прошлый год. Показатель резко вырос на фоне падения добычи газа внутри страны. Увеличились также поставки угля, нефти и нефтепродуктов.",
        "publication": "Сегодня, 15:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/01/52ekU516743288744755_m.jpg"
    },
    {
        "title": "Футбол U-20: Узбекистан сыграет с Аргентиной в матче открытия Кубка мира",
        "context": "Молодёжная сборная Узбекистана по футболу сыграет свой первый матч на чемпионате мира U-20 против Аргентины. Национальная команда также выступит против Новой Зеландии и Гватемалы.",
        "publication": "Сегодня, 14:48",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/B341Ka16821568220296_m.jpg"
    },
    {
        "title": "Экономика Узбекистана выросла на 5,5% по итогам первого квартала",
        "context": "В первом квартале 2023 года ВВП Узбекистана вырос на 5,5%, хотя прогноз в конце января был намного ниже. Объёмы промышленного производства и строительства значительно выросли при том, что ещё в январе-феврале оба показателя были намного меньше данных за прошлый год.",
        "publication": "Сегодня, 14:40",
        "image_link": "https://www.gazeta.uz/media/img/2023/03/PhYZ1X16800679982653_m.jpg"
    },
    {
        "title": "Два человека погибли в ДТП в Коканде",
        "context": "В результате столкновения Lacetti и Mercedes-Benz в Коканде погибли два человека. Водители с травмами госпитализированы в больницу.",
        "publication": "Сегодня, 14:28",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/dyW8PQ16821469401911_m.jpg"
    },
    {
        "title": "Две школьницы в Ташкенте избили другую, возбуждено уголовное дело",
        "context": "Две школьницы жестоко избили девочку, которая младше их, на территории строящегося здания в Янгихаётском районе Ташкента. Несколько девочек наблюдали за этим. Возбуждено уголовное дело по статье «хулиганство».",
        "publication": "Сегодня, 10:39",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/vlk13l16821419034724_m.jpg"
    },
    {
        "title": "Uzbekistan Airways впервые начнёт эксплуатацию A330",
        "context": "Uzbekistan Airways получила первый из двух дальнемагистральных самолётов A330, взятых в «мокрый» лизинг (с экипажами) на год. Лайнер такого типа впервые пополнил парк авиаперевозчиков Узбекистана. Первый рейс запланирован на 23 апреля в Стамбул.",
        "publication": "Вчера, 22:51",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/BmYhjo16820993515068_m.jpg"
    },
    {
        "title": "Всемирный банк поможет Узбекистану улучшить сектор животноводства",
        "context": "На животноводство приходится около 50% ВВП, производимого в агросекторе Узбекистана. При этом оно является источником более 13% всех выбросов парниковых газов в стране, а производительность остаётся низкой. Новый проект ВБ поддержит создание продуктивного и устойчивого к изменению климата сектора.",
        "publication": "Вчера, 12:39",
        "image_link": "https://www.gazeta.uz/media/img/2020/01/TqZhkr15795047782444_m.jpg"
    },
    {
        "title": "Производство газа, электроэнергии и угля в Узбекистане продолжает падать",
        "context": "За первый квартал года добыча газа в Узбекистане упала на 9,6% по сравнению с аналогичным периодом прошлого года, в марте сокращение составило 12,9%. Объём производства электроэнергии за три месяца снизился на 5%. Выработка теплоэнергии и угля также упала.",
        "publication": "Вчера, 12:24",
        "image_link": "https://www.gazeta.uz/media/img/2023/01/sSU7E016738804987322_m.jpg"
    },
    {
        "title": "Президент поздравил народ Узбекистана с Рамазан хайитом",
        "context": "Президент Узбекистана в поздравлении с Рамазан хайитом заявил, что усилия по утверждению в стране свободы совести и возрождению религиозно-духовных ценностей «последовательно продолжатся». Благодаря отмене ограничений в этом году более 31 тыс. узбекистанцев совершили паломничество в Мекку и Медину.",
        "publication": "20 апреля 21:29",
        "image_link": "https://www.gazeta.uz/media/img/2023/03/wXSsB916783739154689_m.jpg"
    },
    {
        "title": "Куда сходить на выходных в Ташкенте",
        "context": "Шесть кинопремьер и кинопоказы под открытым небом, концерты, вечеринки, ярмарки, мероприятия для детей и другие события предстоящих четырёх выходных — в подборке Afisha.uz.",
        "publication": "20 апреля 21:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/NsHCyd16814739114809_m.jpg"
    },
    {
        "title": "Указом президента Узбекистана помилован 541 человек",
        "context": "Президент Узбекистана подписал указ, которым помилован 541 человек, отбывающий наказание за совершение преступлений. Среди них 36 граждан иностранных государств, 136 женщин и 75 мужчин старше 60 лет.",
        "publication": "20 апреля 21:05",
        "image_link": "https://www.gazeta.uz/media/img/2017/12/zVpDrr15126720893731_m.jpg"
    },
    {
        "title": "Объявление выходных вызвало пробки и скачок цен на междугороднее такси",
        "context": "После объявления даты Рамазан хайита в Ташкенте и на выезде из города возникли длинные пробки, подскочили цены на междугородний транспорт, а бизнес столкнулся с накладками: кто-то — с отменой заказов, а кто-то — с наплывом клиентов.",
        "publication": "20 апреля 20:36",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/nZkGvd16820019258061_m.jpg"
    },
    {
        "title": "Региональная авиакомпания Silk Avia начала технические полёты",
        "context": "Министр транспорта Узбекистана, главы Агентства гражданской авиации и компании Uzbekistan Airports поднялись на борт самолёта ATR 72−600 новой авиакомпании Silk Avia, который начал технические полёты. Затем самолёт выполнил маршрут из Ташкента в Нукус, затем в Навои и обратно в Ташкент.",
        "publication": "20 апреля 20:22",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/mW5p1n16820041299813_m.jpg"
    },
    {
        "title": "Что приготовить на Рамазан хайит: праздничные блюда",
        "context": "Самса «Тюльпан», праздничный плов, самса-шурпа, манты «Розочка», пахлава, медовый хворост и другие идеи блюд на Рамазан хайит — в подборке Zira.uz.",
        "publication": "20 апреля 19:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/dFVec616819687826304_m.jpg"
    },
    {
        "title": "Chery принимает участие на выставке Shanghai Auto Show",
        "context": "Компания Chery выходит на новый уровень с технологией PHEV третьего поколения, которую представила на Шанхайской автомобильной выставке Shanghai Auto Show.",
        "publication": "20 апреля 19:00",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/qxXxW416819873549507_m.jpg"
    },
    {
        "title": "Мужчина, напавший на школьницу в Ташкенте, задержан",
        "context": "В ГУВД Ташкента сообщили, что мужчина, напавший на 17-летнюю школьницу, задержан. Им оказался 26-летний житель Самаркандской области.",
        "publication": "20 апреля 17:15",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/Ymacf516819921812826_m.jpg"
    },
    {
        "title": "Мужчина напал на школьницу в Ташкенте",
        "context": "В соцсетях распространилось видео, на котором мужчина нападает на идущую по улице школьницу. Сообщается, что инцидент произошёл в Мирабадском районе Ташкента. Личность нападавшего устанавливается.",
        "publication": "20 апреля 16:08",
        "image_link": "https://www.gazeta.uz/media/img/2023/04/axbXZm16819872910619_m.jpg"
    }
]